Revit 2026 API

# UIControlledApplicationGetDockablePane Method

---
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DockablePane GetDockablePane(
	DockablePaneId id
)
```
```vb
Public Function GetDockablePane (
	id As DockablePaneId
) As DockablePane
```
```cpp
public:
DockablePane^ GetDockablePane(
	DockablePaneId^ id
)
```
```fsharp
member GetDockablePane :
        id : DockablePaneId -> DockablePane
```

#### Parameters

id DockablePaneId

#### Return Value

DockablePane

#### Reference

UIControlledApplication Class

Autodesk.Revit.UI Namespace